In [ ]:
cd "/content/drive/MyDrive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L27"

/content/drive/MyDrive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L27

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
%pwd

'/content/drive/My Drive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L27'

In [ ]:
%ls

L27_LCP.ipynb  sales.db

In [ ]:
%pip install jupysql duckdb duckdb-engine --quiet
# Load the SQL extension
%load_ext sql
# Setting: Show all rows
%config SqlMagic.displaylimit = None
# Connect to SQLite database
%sql sqlite:///sales.db


# Show tables
%sqlcmd tables


# Show columns in a table
%sqlcmd columns -t sale

   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 95.1/95.1 kB 3.4 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 49.7/49.7 kB 2.9 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 192.8/192.8 kB 7.0 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 144.5/144.5 kB 7.9 MB/s eta 0:00:00

displaylimit: Value None will be treated as 0 (no limit)

Connecting to 'sqlite:///sales.db'

+------------------+---------+----------+---------+-------------+
|       name       |   type  | nullable | default | primary_key |
+------------------+---------+----------+---------+-------------+
|      RowNO       | INTEGER |   True   |   None  |      0      |
|     SaleDate     |   TEXT  |   True   |   None  |      0      |
|    CustomerID    | INTEGER |   True   |   None  |      0      |
|    FirstName     |   TEXT  |   True   |   None  |      0      |
|     LastName     |   TEXT  |   True   |   None  |      0      |
|     OrderID      | INTEGER |   True   |   None  |      0      |
|   ProductName    |   TEXT  |   True   |   None  |      0      |
|     Category     |   TEXT  |   True   |   None  |      0      |
|      Color       |   TEXT  |   True   |   None  |      0      |
|    SalePrice     |   REAL  |   True   |   None  |      0      |
|     Quantity     | INTEGER |   True   |   None  |      0      |
| ManufacturerName |   TEXT  |   True   |   None  |      0      |
+------------------+---------+----------+---------+-------------+

In [ ]:
%%sql
select *
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
| RowNO |  SaleDate  | CustomerID | FirstName |  LastName | OrderID |               ProductName               | Category |    Color     | SalePrice | Quantity | ManufacturerName |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
|   1   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        be mini vulc wns sneakers        | sneakers |    Black     |   57.65   |    1     |       Puma       |
|   2   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |              liga sneakers              | sneakers |     Blue     |   63.05   |    1     |       Puma       |
|   3   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     nike air max correlate sneakers     | sneakers |    Black     |    96.6   |    1     |       Nike       |
|   4   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     timberland icon 6" premium boots    |  boots   |    Black     |   116.99  |    1     |    Timberland    |
|   5   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        torry wedge tapestry wedge       |  wedges  | Green,Multi  |   15.29   |    2     |   Fashion Lab    |
|   6   | 12/31/2013 |   14958    |  Russell  |   Baker   |  191229 |  juno buckle animal trim wedge sneaker  |  boots   | Animal Print |   22.99   |    1     |  Apple Bottoms   |
|   7   | 12/31/2013 |    3275    |  Herschel |  Webster  |  191230 |          suede classic sneakers         | sneakers |    Purple    |    53.1   |    1     |       Puma       |
|   8   |  1/1/2014  |   17448    |  Margret  |  Gilmore  |  191231 | natalia high platform suede fringe boot |  boots   |    Black     |   50.04   |    2     |      Dereon      |
|   9   |  1/1/2014  |   11852    |    Ken    |   Carey   |  191232 |           nyc 83 vlc sneakers           | sneakers |    Black     |    72.0   |    1     |      Osiris      |
|   10  |  1/1/2014  |    5230    |    Toru   | Sakaguchi |  191233 |                 chehalis                | sneakers |    Black     |   16.48   |    1     |  Royal Elastics  |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       Category
from sale
group by Category
order by Revenue desc
;

Running query in 'sqlite:///sales.db'

+--------------------+--------------+
|      Revenue       |   Category   |
+--------------------+--------------+
| 620275.3499999918  |   sneakers   |
| 52361.92000000002  |    boots     |
| 37094.77000000009  |   sandals    |
| 29901.470000000034 | casual shoes |
| 15895.36999999998  |    wedges    |
| 13139.659999999998 |    heels     |
| 8626.019999999993  |    flats     |
|       304.72       |   slippers   |
+--------------------+--------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       ManufacturerName
from sale
group by ManufacturerName
order by Revenue desc
;

Running query in 'sqlite:///sales.db'

+--------------------+-----------------------+
|      Revenue       |    ManufacturerName   |
+--------------------+-----------------------+
| 109599.5700000001  |          Nike         |
| 104418.25000000006 |         Adidas        |
| 73795.86000000012  |      Fashion Lab      |
| 50428.97999999998  |  Creative Recreation  |
| 44206.17000000002  |          Puma         |
| 39640.060000000056 |         Reebok        |
| 38836.91000000001  |         Supra         |
| 32040.12000000006  |          Fila         |
| 28991.08000000001  |         Osiris        |
| 28030.980000000014 |       Timberland      |
| 25684.050000000036 |     Apple Bottoms     |
| 21863.17000000002  |      Buyers Picks     |
|      16741.42      |        Converse       |
| 15867.97999999999  |         COOGI         |
| 15772.930000000002 |     Radii Footwear    |
| 10764.539999999994 |         Sebago        |
| 9642.599999999991  |      Pelle Pelle      |
|  9135.84999999999  |       Akademiks       |
| 8860.219999999996  |      New Balance      |
| 8250.010000000002  |        DC Shoes       |
| 6946.009999999997  |        Emerica        |
| 6524.439999999995  |  AH by Android Homme  |
|      6259.53       |        Rocawear       |
| 5948.999999999999  |        Psyberia       |
| 5779.029999999995  |          LRG          |
|      4502.71       |        Gourmet        |
| 4053.2699999999995 |         Y.R.U.        |
| 3943.1799999999967 |     Royal Elastics    |
| 3515.1200000000003 |       Diba True       |
| 3254.8999999999987 |          Lugz         |
| 2862.2399999999993 |         Lakai         |
| 2817.2200000000003 |         Pastry        |
| 2690.9000000000005 |          Levi         |
| 2426.6999999999994 |          Keds         |
|      2209.22       |        Luichiny       |
| 2122.2999999999997 |       Not Rated       |
|      2114.47       |        Grenade        |
| 2060.3900000000003 |     Two Lip Shoes     |
| 2043.6000000000004 | Famous Stars & Straps |
| 1717.1399999999994 |        Bearpaw        |
| 1503.4899999999998 |          HUF          |
|      1430.05       |    Basic Essentials   |
|      1365.87       |         Rothco        |
| 1205.8500000000001 |      Steve Madden     |
| 1180.0299999999997 |         Dereon        |
| 1106.3999999999999 |   Cadillac Footwear   |
| 997.2799999999999  |    Crooks & Castles   |
| 787.3500000000003  |         Mecca         |
|       551.15       |    Cute To The Core   |
| 329.63999999999993 |          MO7          |
|       131.21       |  Unstitched Utilities |
|       113.44       |      Ralph Lauren     |
|       93.43        |     Mountain Gear     |
|       86.44        |          XOXO         |
| 85.75999999999999  |         Shmack        |
|       68.39        |     The Skate Shop    |
|       44.15        |   Florsheim Limited   |
|       44.14        |     Greedy Geniu$     |
| 41.980000000000004 |        Ed Hardy       |
|       30.99        |      DVS Shoe Co.     |
|       21.33        |    Generic Surplus    |
|       18.79        |       Baby Phat       |
+--------------------+-----------------------+

In [ ]:
# 1
%%sql
select Category
from sale
group by Category
;

Running query in 'sqlite:///sales.db'

+--------------+
|   Category   |
+--------------+
|    boots     |
| casual shoes |
|    flats     |
|    heels     |
|   sandals    |
|   slippers   |
|   sneakers   |
|    wedges    |
+--------------+

In [ ]:
%%sql
select distinct Category
from sale
;

Running query in 'sqlite:///sales.db'

+--------------+
|   Category   |
+--------------+
|   sneakers   |
|    boots     |
|    wedges    |
|    flats     |
|   sandals    |
|    heels     |
| casual shoes |
|   slippers   |
+--------------+

In [ ]:
# Lorene Charles
# 2
%%sql
select *
from sale
where FirstName='Lorene' and
      LastName='Charles'
;

Running query in 'sqlite:///sales.db'

+-------+-----------+------------+-----------+----------+---------+---------------------------------------------------------+----------+--------------------------+-----------+----------+------------------+
| RowNO |  SaleDate | CustomerID | FirstName | LastName | OrderID |                       ProductName                       | Category |          Color           | SalePrice | Quantity | ManufacturerName |
+-------+-----------+------------+-----------+----------+---------+---------------------------------------------------------+----------+--------------------------+-----------+----------+------------------+
| 12563 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |               doubleback classic sneakers               | sneakers |          Black           |   28.19   |    1     |   Buyers Picks   |
| 12564 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 | earthkeepers hookset handcrafted fabric oxford sneakers | sneakers |          Brown           |    75.0   |    2     |    Timberland    |
| 12565 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |                    metal beads sandal                   | sandals  |          Black           |    37.6   |    1     |  Apple Bottoms   |
| 12566 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |                 nike flight one sneakers                | sneakers |          White           |   84.63   |    1     |       Nike       |
| 12567 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |                  nm camp leather boots                  |  boots   |          Black           |   74.68   |    1     |    Timberland    |
| 12568 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |                 the cage hightop sneaker                | sneakers | Lime Green,Charcoal,Grey |    67.9   |    1     |       Fila       |
| 12569 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |           wmns sweet classic leather sneakers           | sneakers |          Black           |   50.39   |    1     |       Nike       |
+-------+-----------+------------+-----------+----------+---------+---------------------------------------------------------+----------+--------------------------+-----------+----------+------------------+

In [ ]:
%%sql
select *
from sale
where FirstName='Lorene' and
      LastName='Charles' and
      Category='sneakers'
;

Running query in 'sqlite:///sales.db'

+-------+-----------+------------+-----------+----------+---------+---------------------------------------------------------+----------+--------------------------+-----------+----------+------------------+
| RowNO |  SaleDate | CustomerID | FirstName | LastName | OrderID |                       ProductName                       | Category |          Color           | SalePrice | Quantity | ManufacturerName |
+-------+-----------+------------+-----------+----------+---------+---------------------------------------------------------+----------+--------------------------+-----------+----------+------------------+
| 12563 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |               doubleback classic sneakers               | sneakers |          Black           |   28.19   |    1     |   Buyers Picks   |
| 12564 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 | earthkeepers hookset handcrafted fabric oxford sneakers | sneakers |          Brown           |    75.0   |    2     |    Timberland    |
| 12566 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |                 nike flight one sneakers                | sneakers |          White           |   84.63   |    1     |       Nike       |
| 12568 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |                 the cage hightop sneaker                | sneakers | Lime Green,Charcoal,Grey |    67.9   |    1     |       Fila       |
| 12569 | 11/7/2015 |    9345    |   Lorene  | Charles  |  195505 |           wmns sweet classic leather sneakers           | sneakers |          Black           |   50.39   |    1     |       Nike       |
+-------+-----------+------------+-----------+----------+---------+---------------------------------------------------------+----------+--------------------------+-----------+----------+------------------+

In [ ]:
# count() max(): aggregation
#
# 3
%%sql
select count(*) as NRows
from sale
;

Running query in 'sqlite:///sales.db'

+-------+
| NRows |
+-------+
| 12569 |
+-------+

In [ ]:
%%sql
select count(*) as NRows,
       Category
from sale
group by Category
;

Running query in 'sqlite:///sales.db'

+-------+--------------+
| NRows |   Category   |
+-------+--------------+
|  986  |    boots     |
|  456  | casual shoes |
|  308  |    flats     |
|  342  |    heels     |
|  1042 |   sandals    |
|   8   |   slippers   |
|  8940 |   sneakers   |
|  487  |    wedges    |
+-------+--------------+

In [ ]:
# where: No aggregation function
# having: Must use aggregation function
%%sql
select count(*) as NRows,
       Category
from sale
group by Category
having count(*)>500
;

Running query in 'sqlite:///sales.db'

+-------+----------+
| NRows | Category |
+-------+----------+
|  986  |  boots   |
|  1042 | sandals  |
|  8940 | sneakers |
+-------+----------+

In [ ]:
%%sql
select count(*) as NRows,
       Category
from sale
group by Category
having count(*)>500
order by NRows desc
;

Running query in 'sqlite:///sales.db'

+-------+----------+
| NRows | Category |
+-------+----------+
|  8940 | sneakers |
|  1042 | sandals  |
|  986  |  boots   |
+-------+----------+

In [ ]:
%%sql
select count(*) as NRows,
       Category
from sale
group by Category
having count(*)>500
order by count(*) desc
;

Running query in 'sqlite:///sales.db'

+-------+----------+
| NRows | Category |
+-------+----------+
|  8940 | sneakers |
|  1042 | sandals  |
|  986  |  boots   |
+-------+----------+

In [ ]:
# 4
%%sql
select sum(SalePrice*Quantity) as TotalRevenue
from sale
;

Running query in 'sqlite:///sales.db'

+------------------+
|   TotalRevenue   |
+------------------+
| 777599.279999984 |
+------------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as TotalRevenue,
       Category
from sale
group by Category
order by TotalRevenue desc
;

Running query in 'sqlite:///sales.db'

+--------------------+--------------+
|    TotalRevenue    |   Category   |
+--------------------+--------------+
| 620275.3499999918  |   sneakers   |
| 52361.92000000002  |    boots     |
| 37094.77000000009  |   sandals    |
| 29901.470000000034 | casual shoes |
| 15895.36999999998  |    wedges    |
| 13139.659999999998 |    heels     |
| 8626.019999999993  |    flats     |
|       304.72       |   slippers   |
+--------------------+--------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as TotalRevenue,
       Category
from sale
group by Category
order by sum(SalePrice*Quantity) desc
;

Running query in 'sqlite:///sales.db'

+--------------------+--------------+
|    TotalRevenue    |   Category   |
+--------------------+--------------+
| 620275.3499999918  |   sneakers   |
| 52361.92000000002  |    boots     |
| 37094.77000000009  |   sandals    |
| 29901.470000000034 | casual shoes |
| 15895.36999999998  |    wedges    |
| 13139.659999999998 |    heels     |
| 8626.019999999993  |    flats     |
|       304.72       |   slippers   |
+--------------------+--------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as TotalRevenue,
       Category
from sale
group by Category
having sum(SalePrice*Quantity)>30000
order by sum(SalePrice*Quantity) desc
;

Running query in 'sqlite:///sales.db'

+-------------------+----------+
|    TotalRevenue   | Category |
+-------------------+----------+
| 620275.3499999918 | sneakers |
| 52361.92000000002 |  boots   |
| 37094.77000000009 | sandals  |
+-------------------+----------+

In [ ]:
# 5
%%sql
select sum(Quantity) as NPairsSold,
       Category
from sale
group by Category
;

Running query in 'sqlite:///sales.db'

+------------+--------------+
| NPairsSold |   Category   |
+------------+--------------+
|    1148    |    boots     |
|    525     | casual shoes |
|    357     |    flats     |
|    382     |    heels     |
|    1187    |   sandals    |
|     8      |   slippers   |
|   10293    |   sneakers   |
|    569     |    wedges    |
+------------+--------------+

In [ ]:
%%sql
select sum(Quantity) as NPairsSold,
       Category
from sale
group by Category
having sum(Quantity)<500
order by NPairsSold asc
;

Running query in 'sqlite:///sales.db'

+------------+----------+
| NPairsSold | Category |
+------------+----------+
|     8      | slippers |
|    357     |  flats   |
|    382     |  heels   |
+------------+----------+

In [ ]:
%%sql
select *
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
| RowNO |  SaleDate  | CustomerID | FirstName |  LastName | OrderID |               ProductName               | Category |    Color     | SalePrice | Quantity | ManufacturerName |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
|   1   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        be mini vulc wns sneakers        | sneakers |    Black     |   57.65   |    1     |       Puma       |
|   2   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |              liga sneakers              | sneakers |     Blue     |   63.05   |    1     |       Puma       |
|   3   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     nike air max correlate sneakers     | sneakers |    Black     |    96.6   |    1     |       Nike       |
|   4   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     timberland icon 6" premium boots    |  boots   |    Black     |   116.99  |    1     |    Timberland    |
|   5   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        torry wedge tapestry wedge       |  wedges  | Green,Multi  |   15.29   |    2     |   Fashion Lab    |
|   6   | 12/31/2013 |   14958    |  Russell  |   Baker   |  191229 |  juno buckle animal trim wedge sneaker  |  boots   | Animal Print |   22.99   |    1     |  Apple Bottoms   |
|   7   | 12/31/2013 |    3275    |  Herschel |  Webster  |  191230 |          suede classic sneakers         | sneakers |    Purple    |    53.1   |    1     |       Puma       |
|   8   |  1/1/2014  |   17448    |  Margret  |  Gilmore  |  191231 | natalia high platform suede fringe boot |  boots   |    Black     |   50.04   |    2     |      Dereon      |
|   9   |  1/1/2014  |   11852    |    Ken    |   Carey   |  191232 |           nyc 83 vlc sneakers           | sneakers |    Black     |    72.0   |    1     |      Osiris      |
|   10  |  1/1/2014  |    5230    |    Toru   | Sakaguchi |  191233 |                 chehalis                | sneakers |    Black     |   16.48   |    1     |  Royal Elastics  |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+